In [52]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\dsadm\appdata\roaming\python\python313\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [53]:
import pandas as pd

In [54]:
dicionario = {
    'A': [1, 2, 3],
    'B': [-3, -2, -1],
    'C': [0, 10, 20],
    }
label =  ['1 linha', '2 linha', '3 linha']
datafreme = pd.DataFrame(data=dicionario, index=label)
print(datafreme)

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [55]:
datafreme[['A','B']]

         A  B
1 linha  1 -3
2 linha  2 -2
3 linha  3 -1

In [56]:
datafreme['nova coluna'] = datafreme['A'] * datafreme['B']

In [57]:
datafreme

         A  B   C  nova coluna
1 linha  1 -3   0           -3
2 linha  2 -2  10           -4
3 linha  3 -1  20           -3

In [58]:
A = 6
print(A)
datafreme

6

         A  B   C  nova coluna
1 linha  1 -3   0           -3
2 linha  2 -2  10           -4
3 linha  3 -1  20           -3

In [59]:
datafreme.drop('nova coluna', axis=1)

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [60]:
datafreme.drop('nova coluna', axis=1, inplace=True)

In [61]:
datafreme

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [62]:
datafreme.loc['1 linha']

A    1
B   -3
C    0
Name: 1 linha, dtype: int64

In [63]:
datafreme.loc['2 linha']

A     2
B    -2
C    10
Name: 2 linha, dtype: int64

In [64]:
datafreme.loc['3 linha']

A     3
B    -1
C    20
Name: 3 linha, dtype: int64

In [65]:
datafreme.loc[['1 linha', '2 linha'],['A', 'C']]

         A   C
1 linha  1   0
2 linha  2  10

In [66]:
datafreme.iloc[2:3, 1:]

         B   C
3 linha -1  20

In [67]:
print(datafreme)
datafreme > 0

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

            A      B      C
1 linha  True  False  False
2 linha  True  False   True
3 linha  True  False   True

In [68]:
filtro = datafreme['C'] > 0
datafreme2 = datafreme[filtro]
datafreme2

         A  B   C
2 linha  2 -2  10
3 linha  3 -1  20

In [69]:
datafreme[(datafreme['A']>1) & (datafreme['C']>0)]

         A  B   C
2 linha  2 -2  10
3 linha  3 -1  20

In [70]:
datafreme

         A  B   C
1 linha  1 -3   0
2 linha  2 -2  10
3 linha  3 -1  20

In [71]:
datafreme.reset_index()

     index  A  B   C
0  1 linha  1 -3   0
1  2 linha  2 -2  10
2  3 linha  3 -1  20

In [72]:
datafreme.reset_index(inplace=True)

In [73]:
datafreme.drop('level_0', axis=1, inplace=True)

KeyError: "['level_0'] not found in axis"

In [ ]:
datafreme.drop('index', axis=1, inplace=True)

In [ ]:
datafreme

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [78]:
dicionario_01 = {
    'A': [1, 2, 3],
    'B': [-32, -21, -15],
    'C': [60, 10, 20],
    'chave': ['AA', 'BB', 'CC']
    }

dicionario_02 = {
    'A': [6, 7, 8],
    'B': [-39, -28, -17],
    'C': [1000, 10, 60],
    'chave': ['AA', 'BB', 'CC']
    }

dicionario_03 = {
    'A': [11, 12, 13],
    'B': [-39, -22, -11],
    'C': [30, 10, 20],
    'chave': ['AA', 'BB', 'CC']
    }

label_01 =  ['1 linha', '2 linha', '3 linha']
label_02 =  ['4 linha', '5 linha', '6 linha']  
label_03 =  ['7 linha', '8 linha', '9 linha']


dataframe_01 = pd.DataFrame(data=dicionario_01, index=label_01)
dataframe_02 = pd.DataFrame(data=dicionario_02, index=label_02)
dataframe_03 = pd.DataFrame(data=dicionario_03, index=label_03)

In [ ]:
dataframe_01

         A   B   C chave
1 linha  1 -32  60    AA
2 linha  2 -21  10    BB
3 linha  3 -15  20    CC

In [ ]:
dataframe_02

         A   B     C chave
4 linha  6 -39  1000    AA
5 linha  7 -28    10    BB
6 linha  8 -17    60    CC

In [ ]:
dataframe_03

          A   B   C chave
7 linha  11 -39  30    AA
8 linha  12 -22  10    BB
9 linha  13 -11  20    CC

In [ ]:
pd.concat([dataframe_01, dataframe_02, dataframe_03])

          A   B     C chave
1 linha   1 -32    60    AA
2 linha   2 -21    10    BB
3 linha   3 -15    20    CC
4 linha   6 -39  1000    AA
5 linha   7 -28    10    BB
6 linha   8 -17    60    CC
7 linha  11 -39    30    AA
8 linha  12 -22    10    BB
9 linha  13 -11    20    CC

In [81]:
pd.merge(dataframe_01, dataframe_02, how='inner', on='chave')

   A_x  B_x  C_x chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [84]:
pd.merge(dataframe_01, dataframe_03, how='left', on='chave')

   A_x  B_x  C_x chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [85]:
pd.merge(dataframe_01, dataframe_03, how='right', on='chave')

   A_x  B_x  C_x chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [86]:
pd.merge(dataframe_01, dataframe_02, how='outer', on='chave')

   A_x  B_x  C_x chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [88]:
dic1 = {
    'A': [1, 2, 3],
    'B': [-32, -21, -15],
    'C': [60, 10, 20],
}
dic2 = {
    'D': [6, 7, 8],
    'E': [-39, -27, -17],  
    'F': [1000, 10, 60],
}

label1a = ['1 linha', '2 linha', '3 linha']

df01 = pd.DataFrame(dic1, index=label1a)
df02 = pd.DataFrame(dic2, index=label1a)

In [89]:
df01

         A   B   C
1 linha  1 -32  60
2 linha  2 -21  10
3 linha  3 -15  20

In [90]:
df02

         D   E     F
1 linha  6 -39  1000
2 linha  7 -27    10
3 linha  8 -17    60

In [91]:
df01.join(df02)

         A   B   C  D   E     F
1 linha  1 -32  60  6 -39  1000
2 linha  2 -21  10  7 -27    10
3 linha  3 -15  20  8 -17    60